class User:
    def __init__(self, username, password):
        self.username = username
        self.password = password
    
    def get_info(self):
        print(f"Username ")
# принцип ооп обьединение 
# ООП
# 1 наследование 
# mro 
# виды наследование 

# 2 полиформизм 
# одно название в разных методах

# 3. Инкапсуляция 
# (1). Трактовки 
# (2). одно капсула 
# (3). ограничение доступа 

# 4. Абстракция 
# (1). способ связи 

# 5.Ассоциация 
# (1) Агрегация - слабая связь 
# (2) Капсуляция - силная связь 